{
    "Elymod – Modular Mini Framework for Laravel": "Elymod – Mini Framework Modular para Laravel",
    "Elymod": "Elymod",
    "Purpose": "Propósito",
    "Architecture": "Arquitectura",
    "Features": "Características",
    "Module Isolation": "Aislamiento de Módulos",
    "My Admin": "Mi Administración",
    "Modular Framework v1.0": "Framework Modular v1.0",
    "Build": "Construye",
    "Modular": "Modular",
    "OAuth2 Modules": "Módulos OAuth2",
    "Elymod is a lightweight mini-framework designed specifically for building": "Elymod es un mini-framework ligero diseñado específicamente para construir",
    "independent modules": "módulos independientes",
    "for OAuth2 Passport servers. Each module is self-contained with its own dependencies, licensing, and functionality.": "para servidores OAuth2 Passport. Cada módulo es autónomo con sus propias dependencias, licencias y funcionalidades.",
    "Explore Architecture": "Explorar Arquitectura",
    "Independent": "Independiente",
    "Self-contained modules": "Módulos autocontenidos",
    "Laravel Bridge": "Puente con Laravel",
    "Familiar Artisan commands": "Comandos Artisan familiares",
    "Dependency Isolation": "Aislamiento de Dependencias",
    "No parent dependency conflicts": "Sin conflictos con dependencias del proyecto padre",
    "OAuth2 Ready": "Listo para OAuth2",
    "Passport integration": "Integración con Passport",
    "Purpose: Modular OAuth2 Extension Framework": "Propósito: Framework Modular de Extensión OAuth2",
    "Elymod is specifically designed to extend": "Elymod está diseñado específicamente para extender",
    "OAuth2 Passport Authorization Servers": "Servidores de Autorización OAuth2 Passport",
    "with pluggable modules. Each module is completely independent with its own:": "con módulos enchufables. Cada módulo es completamente independiente con su propio:",
    "Independent Dependencies": "Dependencias Independientes",
    "Modules install dependencies in their own vendor directory, never relying on the parent application.": "Los módulos instalan sus dependencias en su propio directorio vendor, sin depender de la aplicación principal.",
    "Separate Licensing": "Licenciamiento Separado",
    "Each module can have its own license, allowing different teams to develop and distribute modules independently.": "Cada módulo puede tener su propia licencia, permitiendo a distintos equipos desarrollar y distribuir módulos de forma independiente.",
    "Self-Contained Functionality": "Funcionalidad Autocontenida",
    "Modules include all necessary code, configuration, and assets. No shared codebase conflicts.": "Los módulos incluyen todo el código, configuración y recursos necesarios. Sin conflictos de código compartido.",
    "The Problem We Solve": "El Problema que Resolvemos",
    "Traditional Module Systems": "Sistemas de Módulos Tradicionales",
    "Modules depend on parent application dependencies, causing version conflicts and breaking changes.": "Los módulos dependen de las dependencias de la aplicación principal, causando conflictos de versión y cambios incompatibles.",
    "Elymod Solution": "Solución Elymod",
    "Each module is truly independent. Dependencies are installed within the module, never searching the parent vendor.": "Cada módulo es verdaderamente independiente. Las dependencias se instalan dentro del módulo, sin buscar en el vendor principal.",
    "Architecture: Independent Module Framework": "Arquitectura: Framework de Módulos Independientes",
    "Elymod provides a complete Laravel-like environment for each module, powered by Laravel Runtime bridge.": "Elymod proporciona un entorno completo similar a Laravel para cada módulo, impulsado por Laravel Runtime.",
    "Dependency Flow": "Flujo de Dependencias",
    "OAuth2 Passport Server": "Servidor OAuth2 Passport",
    "Main application that loads modules": "Aplicación principal que carga los módulos",
    "Module (Shop/Auth/Users)": "Módulo (Shop/Auth/Users)",
    "Independent module with own dependencies": "Módulo independiente con sus propias dependencias",
    "Depends on:": "Depende de:",
    "Elymod Framework": "Framework Elymod",
    "Mini-framework with Laravel Runtime": "Mini-framework con Laravel Runtime",
    "Provides:": "Proporciona:",
    "Artisan commands, Service Container, etc.": "Comandos Artisan, contenedor de servicios, etc.",
    "Laravel Runtime Bridge": "Puente Laravel Runtime",
    "Familiar Artisan Experience": "Experiencia Artisan Familiar",
    "Laravel Runtime provides a minimal Laravel bridge that enables familiar Artisan commands while removing unnecessary overhead.": "Laravel Runtime proporciona un puente mínimo de Laravel que habilita comandos Artisan familiares eliminando sobrecarga innecesaria.",
    "Laravel-Like Structure": "Estructura Similar a Laravel",
    "Maintains familiar Laravel directory structure (app/, config/, database/) but lightweight.": "Mantiene la estructura familiar de Laravel (app/, config/, database/) pero de forma ligera.",
    "Essential Commands Only": "Solo Comandos Esenciales",
    "Includes only make:* commands and essential utilities. Removes unnecessary Laravel components.": "Incluye solo comandos make:* y utilidades esenciales. Elimina componentes innecesarios de Laravel.",
    "Complete Module Isolation": "Aislamiento Completo de Módulos",
    "Each module is a self-contained unit with its own dependencies, preventing conflicts with other modules or the parent application.": "Cada módulo es una unidad autocontenida con sus propias dependencias, evitando conflictos con otros módulos o la aplicación principal.",
    "Module Directory Structure": "Estructura de Directorios del Módulo",
    "Dependency Resolution": "Resolución de Dependencias",
    "How modules find and load dependencies": "Cómo los módulos encuentran y cargan dependencias",
    "Module Vendor Directory": "Directorio Vendor del Módulo",
    "First checks modules/shop/vendor/ for dependencies. Never looks in parent vendor.": "Primero revisa modules/shop/vendor/ para dependencias. Nunca busca en el vendor principal.",
    "No Parent Fallback": "Sin Fallback al Padre",
    "Crucially, modules NEVER fall back to parent application dependencies. Complete isolation.": "De forma crucial, los módulos NUNCA recurren a las dependencias de la aplicación principal. Aislamiento total.",
    "Version Safety": "Seguridad de Versiones",
    "Modules can use different dependency versions without conflicting with the parent or other modules.": "Los módulos pueden usar diferentes versiones de dependencias sin conflictos con el proyecto padre u otros módulos.",
    "Independent Development": "Desarrollo Independiente",
    "Teams can develop modules independently, without coordinating dependency updates with the main application.": "Los equipos pueden desarrollar módulos de forma independiente sin coordinar actualizaciones con la aplicación principal.",
    "Easy Distribution": "Distribución Sencilla",
    "Modules can be packaged and distributed independently, including all their dependencies.": "Los módulos pueden empaquetarse y distribuirse de forma independiente, incluyendo todas sus dependencias.",
    "Core Features": "Características Principales",
    "Everything you need for building truly independent OAuth2 modules": "Todo lo necesario para construir módulos OAuth2 verdaderamente independientes",
    "Self-Contained Dependencies": "Dependencias Autocontenidas",
    "Each module installs and manages its own dependencies. No reliance on parent application packages.": "Cada módulo instala y gestiona sus propias dependencias. Sin depender de paquetes del proyecto principal.",
    "Laravel Artisan Commands": "Comandos Artisan de Laravel",
    "Full Laravel development experience with make commands, migrations, and familiar workflows.": "Experiencia completa de desarrollo Laravel con comandos make, migraciones y flujos familiares.",
    "Service Container Integration": "Integración con el Contenedor de Servicios",
    "Full service container support. Modules can register their own service providers and bindings.": "Soporte completo del contenedor de servicios. Los módulos pueden registrar sus propios service providers y bindings.",
    "Start Building Independent Modules": "Comienza a Construir Módulos Independientes",
    "Build truly independent OAuth2 modules with Elymod. No dependency conflicts, separate licensing, and familiar Laravel workflow.": "Construye módulos OAuth2 verdaderamente independientes con Elymod. Sin conflictos de dependencias, licencias separadas y flujo Laravel familiar.",
    "Get Started on GitHub": "Comenzar en GitHub",
    "View Documentation": "Ver Documentación",
    "A lightweight modular mini-framework for Laravel OAuth2 modules.": "Un mini-framework modular y ligero para módulos OAuth2 en Laravel.",
    "Community": "Comunidad",
    "Legal": "Legal",
    "License": "Licencia",
    "Modular Mini Framework": "Mini Framework Modular",
    "Designed & built by": "Diseñado y desarrollado por",
    "Admin Dashboard": "Panel de Administración",
    "Example admin view provided by Elymod": "Vista de administración de ejemplo proporcionada por Elymod",
    "Welcome": "Bienvenido",
    "Module Status": "Estado del Módulo",
    "This area is intended for module-specific data.": "Esta área está destinada a datos específicos del módulo.",
    "Active": "Activo",
    "Quick Actions": "Acciones Rápidas",
    "Define actions related to your module here.": "Define acciones relacionadas con tu módulo aquí.",
    "Create Resource": "Crear Recurso",
    "Notes for Developers": "Notas para Desarrolladores",
    "Keep logic inside the module": "Mantén la lógica dentro del módulo",
    "Use Inertia props for data": "Usa props de Inertia para los datos",
    "Avoid global state unless necessary": "Evita el estado global a menos que sea necesario"
}